"""
Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді коду Морзе та
виводить декодоване значення (латинськими літерами).
   Особливості:
    - використовуються лише крапки, тире і пробіли (.- )
    - один пробіл означає нову літеру
    - три пробіли означають нове слово
    - результат може бути case-insensetive (на ваш розсуд - велики чи маленькими літерами).
    - для простоти реалізації - цифри, знаки пунктуацїї, дужки, лапки тощо використовуватися
    не будуть. Лише латинські літери.
    - додайте можливість декодування сервісного сигналу SOS (...---...)
    Приклад:
    --. . . -.- .... ..- -...   .. ...   .... . .-. .
    результат: GEEKHUB IS HERE
"""


def morse_code(morse_code_string):
    morse_decode_dict = {".-": "A", "-...": "B", "-.-.": "C", "-..": "D",
                         ".": "E", "..-.": "F", "--.": "G", "....": "H",
                         "..": "I", ".---": "J", "-.-": "K", ".-..": "L",
                         "--": "M", "-.": "N", "---": "O", ".--.": "P",
                         "--.-": "Q", ".-.": "R", "...": "S", "-": "T",
                         "..-": "U", "...-": "V", ".--": "W", "-..-": "X",
                         "-.--": "Y", "--..": "Z", '...---...': 'SOS'}

    morse_code_string = morse_code_string.strip()
    words = morse_code_string.split('   ')
    decoded_message = ''

    for word in words:
        letters = word.split(' ')

        for letter in letters:
            if letter in morse_decode_dict:
                decoded_message += morse_decode_dict[letter]
            else:
                decoded_message += ''
        decoded_message += ' '

    return decoded_message


if __name__ == "__main__":
    print(morse_code('--. . . -.- .... ..- -...   .. ...   .... . .-. .'))